# Taps
tap "hashicorp/tap"

# Essentials
brew "vim"
brew "starship"
brew "mas" if OS.mac?
brew "fzf"
brew "neovim"
brew "tmux"
cask "1password"
brew "zsh-completions"
brew "ca-certificates"
cask "google-drive"
cask "kindle"
cask "whatsapp"
cask "microsoft-teams"
cask "grammarly-desktop"
cask "messenger"

# Developer Tools
brew "git"
cask "iterm2"
cask "jetbrains-toolbox"
brew "gh"
brew "jq"
brew "go"
brew "hashicorp/tap/packer"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/vault"
cask "font-jetbrains-mono-nerd-font"
cask "slack"
brew "awscli"
brew "azure-cli"
brew "maven"
brew "openjdk"
brew "node"
brew "kubernetes-cli"
cask "figma"

# Fun
cask "spotify"
cask "discord"
cask "ableton-live-standard"
cask "mixed-in-key"
cask "notion"
cask "splice"
cask "rekordbox"

# AppStore Apps
mas "1Blocker", id: 1365531024
mas "1Password for Safari", id: 1569813296
mas "Magnet", id: 441258766
#mas "Final Cut Pro", id: 424389933


# Outdated MacOS deps
brew "coreutils"
brew "findutils"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "gnupg"
brew "gnutls"
brew "grep"
brew "make"
brew "moreutils"

